---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PointFailures.CantChangeParamRotate
source: html/0185ce7e-7cd6-8d6a-5f42-50444ff46f60.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures.CantChangeParamRotate Property

Can't rotate Element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantChangeParamRotate { get; }
```